import { gsap } from 'gsap';

// ! gsap.to()
// to - анімація починається з поточного стану елемента та анімується «до» значень, визначених у анімації.
// box__1 - таргет (якого обєкту стосується анімація)
// x: - на скільки відправити
gsap.to('.box__1', {
  duration: 2,
  x: 500,
  rotation: 360,
  yoyo: true,
  repeat: 2,
});

gsap.to('.box__2', {
  rotation: 360,
  duration: 2,
  delay: 1,
});

// ! gsap.from()
// from - зворотний рух, .to()де анімація починається "від" значень, визначених у твіні , і завершується поточним станом елемента.

// ! gsap.fromTo()
// fromTo() - Ви визначаєте як початкове , так і кінцеве значення.
gsap.fromTo('.box__3', { x: 500 });

// ! gsap.set() Миттєво встановлює властивості (без анімації). Це, по суті, твін з нульовою тривалістю .to().

//* duration - Тривалість анімації (секунди) За замовчуванням: 0,5
//* delay - Затримка перед початком анімації (секунди)
//* repeat - Скільки разів має повторюватися анімація.
//* yoyo - Якщо значення true, то через кожне повторення твін працюватиме у протилежному напрямку. (як йо-йо) За замовчуванням: false
//* stagger - Час (у секундах) між початком анімації кожної цілі (якщо вказано кілька цілей)
//* ease - Контролює швидкість змін під час анімації, наприклад, «особистість» або відчуття руху. За замовчуванням: «power1.out»
//* onComplete - Функція, яка виконується після завершення анімації
